/**
 * 类型
 * Created by admin on 2016/10/27.
 */
module.exports = {
  EMAIL    : {
    // 1: '激活邮件',
    ACTIVE: 1,
    // 2: '改密邮件'
    CHANGE_PWD: 2
  },
  STRATEGY : {
    // 1: '每个邮箱类型随机一个',
    ONE_FROM_EACH: 1,
    // 2: '每个邮箱类型随机三个',
    THREE_FROM_EACH: 2,
    // 3: '全部邮箱'
    ALL: 3
  },
  STRATEGY_ZN : {
     1: '每个邮箱类型随机一个',
     2: '每个邮箱类型随机三个',
     3: '全部邮箱'
  },
  HOST_IPs : [
    '121.201.116.194',
    '121.201.116.27',
    '119.188.15.133',
    '121.201.102.124',
    '113.106.204.12',
//    '113.106.204.38',
//    '113.106.204.55',
//    '113.106.204.101'
  ],
  PUSH_TIME: {
    // 1: '检测报告生成后',
    AFTER_TEST: 1,
    // 2: '每天09:00',
    NINE_EVERY_DAY: 2,
    // 3: '每周一09:00'
    NINE_EVERY_MONDAY: 3
  },
  PUSH_TIME_ZN: {
     1: '检测报告生成后',
     2: '每天09:00',
     3: '每周一09:00'
  }
};
